network_basics/proj-week/proj-week.tex
% Created 2020-04-18 Sat 12:09
% Intended LaTeX compiler: pdflatex
\documentclass{article} [NO-DEFAULT-PACKAGES] \usepackage{wx672hyperref}
\usepackage{amsmath}
\usepackage{amsfonts}
\usepackage{amssymb}
\usepackage{graphicx}
\usepackage{wx672common,wx672fonts}
\pagestyle{plain}


\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Xiaolin Wang}
\date{June 2019}
\title{Network Project Week}
\hypersetup{
 pdfauthor={Xiaolin Wang},
 pdftitle={Network Project Week},
 pdfkeywords={ssh, tmux, http, ftp, smtp, iptables, network, networking},
 pdfsubject={Network lab tutorial week},
 pdfcreator={Emacs 26.1 (Org mode 9.3.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Caution}
\label{sec:orgc02b7a2}
\begin{itemize}
\item You are \textbf{required} to write your report with \href{http://orgmode.org/}{\texttt{Emacs org-mode}}
\begin{itemize}
\item Org-mode Tutorials
\begin{itemize}
\item \href{http://orgmode.org/worg/org-tutorials/orgtutorial\_dto.php}{David O'Toole Org tutorial}
\item \href{http://orgmode.org/worg/org-tutorials/index.php}{More org-mode tutorials}
\item \texttt{info org}
\end{itemize}
\item \href{http://emacser.com/}{Emacs中文网}
\end{itemize}
\item You have to submit your report as a \texttt{tar ball} which have both an \href{20141156xxx.org}{\texttt{org file}} and a
generated \href{20141156xxx.html}{\texttt{html file}} included.
\begin{itemize}
\item Report template: \href{20141156xxx.org}{\texttt{org file}}, \href{20141156xxx.html}{\texttt{html file}}
\item A small tutorial about writing lab report: \href{tutorial.ttyrec}{\texttt{tutorial.ttyrec}}. To view it:
\begin{verbatim}
ttyplay tutorial.ttyrec
\end{verbatim}

Feel free to make your own \texttt{ttyrec} file while doing this lab work. For example:
\begin{verbatim}
ttyrec my-ssh-lab-work.ttyrec
ttyrec my-http-lab-work.ttyrec
ttyrec my-email-lab-work.ttyrec
ttyrec my-ftp-lab-work.ttyrec
ttyrec my-iptables-lab-work.ttyrec
\end{verbatim}
\item This file itself is generated from an \href{proj-week.org}{org file (proj-week.org)}. You can take it as an example.
\end{itemize}
\item \textbf{Deadline:} \texttt{2019-06-28 (Fri), 23:59}
\begin{itemize}
\item Submit your report as a \texttt{tgz} file \href{https://cs6.swfu.edu.cn/moodle/mod/assign/view.php?id=1548}{here}. In your \texttt{tgz} file, there must be:
\begin{itemize}
\item an org file
\item an html file
\item optionally one or more \texttt{ttyrec} files
\end{itemize}
\item Late reports will be penalized 20\% per day.
\end{itemize}
\item MS-word file will \textbf{NOT} be accepted.
\item Cheating will result in automatic failure of this work.
\end{itemize}
\section{SSH (25 pts)}
\label{sec:org1a9f2bc}
\subsection{Installation (5 pts)}
\label{sec:orgf20b822}
In our Debian system, \texttt{openssh-server} and \texttt{openssh-client} are installed by
default. And the \texttt{ssh server} should have been running. You can check it by
\begin{verbatim}
nmap localhost
\end{verbatim}

The output of the above command should contain the following line:
\begin{verbatim}
22/tcp    open    ssh
\end{verbatim}

And you should be able to connect to your local \texttt{ssh server} by
\begin{verbatim}
ssh username@localhost
\end{verbatim}

\textbf{NOTE:} You should change \texttt{username} to your real user name (should be \texttt{stud} in the
lab).

If you cannot find the \texttt{ssh server} nor can you find the \texttt{ssh} command, you should
check whether the \texttt{openssh-server} and \texttt{openssh=client} are installed by
\begin{verbatim}
aptitude search '~i openssh'
\end{verbatim}

If you cannot see any outputs, that means you haven't got the necessary packages
install. So you have to install them by
\begin{verbatim}
sudo aptitude install openssh-client openssh-server
\end{verbatim}

\subsection{Basic usage (5 pts)}
\label{sec:org66cdc48}
\begin{verbatim}
ssh user@server
\end{verbatim}

You've tried connecting your own \texttt{ssh server} in previous section. Now you can try
\texttt{ssh} into your neighbor's system.

And you can also try
\begin{verbatim}
ssh user@server [command]
\end{verbatim}

Where \texttt{command} could be any valid \texttt{shell command}, for example
\begin{verbatim}
ssh user@server ls -l
ssh user@server df
ssh user@server w
ssh user@server free
\end{verbatim}

\subsection{SSH without password (5 pts)}
\label{sec:org44f30ae}
If you want to login to \texttt{cs3.swfu.edu.cn} without being asked for password
every time, you can do the following:
\begin{enumerate}
\item Generate a new keypair
\begin{verbatim}
ssk-keygen -t rsa
\end{verbatim}
\item Copy the keyfile to remote machine (\texttt{cs3.swfu.edu.cn}).
\begin{verbatim}
ssh-copy-id username@cs3.swfu.edu.cn
\end{verbatim}
\item Login to \texttt{cs3} without password prompt
\begin{verbatim}
ssh username@cs3.swfu.edu.cn
\end{verbatim}
\item \textbf{CAUTION!} If you are doing the above steps at a lab PC, now you \textbf{must} remove the \texttt{key
      file}, otherwise everybody using this PC can login to your \texttt{cs3 account} without a
password!
\begin{verbatim}
rm -rf ~/.ssh
\end{verbatim}

This password-less setup should only be used within your own private computer,
e.g. your laptop. \textbf{DO NOT USE IT AT ANY PUBLIC COMPUTER!!!}
\end{enumerate}
\subsection{Port forwarding (5 pts)}
\label{sec:org8d3f909}
\subsubsection{Reverse port forwarding}
\label{sec:org4afcd8b}

\verbatimfont{\tiny\dejavu}
\begin{verbatim}
                                                            Firewall
                                                          (Home router)
                                                                ▒           ┌──────┐
┌─────┐  (2)  ┌─────────┐      (1)                              ▒           │      │
│ You ── ssh ───> cs3   ╘════< ssh -R 3333:localhost:22 cs3.swfu.edu.cn <═══╛      │
└─────┘       │    │      (3)                                                 Home │
              │    │ ┌────────────────> ssh -p 3333 localhost ─────────────>   PC  │
              │    v │                                                             │
              │   3333  ╒═══════════════════<<<═════════════════════════════╕      │
              └─────────┘                                       ▒           │      │
                                                                ▒           └──────┘
\end{verbatim}

As long as you can login to \texttt{cs3}, this setup enables you to access your home PC from
anywhere!

\begin{enumerate}
\item At your home PC, do
\begin{verbatim}
ssh -R 3333:localhost:22 cs3user@cs3.swfu.edu.cn
\end{verbatim}

This will open up a \emph{reverse ssh tunnel} to \texttt{cs3.swfu.edu.cn}.
\item At \texttt{cs3}, do
\begin{verbatim}
ssh -p 3333 homeuser@localhost
\end{verbatim}

Now, a connection is made from \texttt{cs3:22} to \texttt{your-home-pc:3333}.
\item \textbf{Your task:} use \texttt{netstat} at both local and remote side to figure out the TCP
connections in this setup.
\end{enumerate}

\subsubsection{Local port forwarding}
\label{sec:org0c544c4}

\verbatimfont{\small\dejavu}
\begin{verbatim}
┌─────────┐
│         │    (1)                        ┌─────┐
│   You   ╘══> ssh cs3 -L 3333:cs2:80 >═══╛ cs3 │   ┌────────┐
│    │                                          │   │        │
│ (2)│ ┌────> curl -v http://localhost:3333 ────────> cs2:80 │
│    v │                                        │   │        │
│   3333  ╒═════════════>>>═══════════════╕     │   └────────┘
│         │                               └─────┘
└─────────┘
\end{verbatim}

\begin{enumerate}
\item At your PC (usually restricted), do
\begin{verbatim}
ssh user@cs3.swfu.edu.cn -L 3333:cs2.swfu.edu.cn:80
\end{verbatim}

Local machine listens on port 3333, and forward traffic to \texttt{cs2} on port 80.  That
means you can open a web browser, and visit \href{http://localhost:3333}{\texttt{http://localhost:3333}}. You should see
the same page as \href{http://cs2.swfu.edu.cn}{\texttt{http://cs2.swfu.edu.cn}}
\item \textbf{Your task:} use \texttt{netstat} at both local and remote side to figure out the TCP
connections in this setup.
\end{enumerate}

\subsubsection{References}
\label{sec:org97a7f0e}
\begin{itemize}
\item \href{https://www.grid5000.fr/mediawiki/index.php/SSH\#Tips}{SSH Tips}
\item \href{http://matt.might.net/articles/ssh-hacks/}{SSH: More than secure shell}
\item \href{https://serversforhackers.com/ssh-tricks}{SSH Tricks}
\item \href{http://www.aptivate.org/en/blog/2010/03/10/ssh-port-forwarding/}{SSH Port Forwarding}
\item \href{http://www.onlamp.com/pub/a/onlamp/excerpt/ssh\_11/index3.html}{SSH, The Secure Shell: The Definitive Guide --- SSH Port Forwarding}
\end{itemize}

\subsection{Pair working with SSH+Tmux (5 pts)}
\label{sec:org6951b7e}
Suppose Alice and Bob are both sitting in our A7 lab. And they're working on a
cooperative project. Sometimes they have to edit a file, e.g. \texttt{helloworld.c}
together. How? Very easy\ldots{}
\subsubsection{Case 1}
\label{sec:org4abd9b4}
If both Alice and Bob use the same username (e.g. \texttt{stud}) to work together,
\begin{enumerate}
\item Bob opens a terminal. At the command prompt, he types:
\begin{verbatim}
tmux new -s pair
\end{verbatim}
\item Alice logins to Bob's machine via SSH:
\begin{verbatim}
ssh stud@bob.ip.address
tmux a -t pair
\end{verbatim}
\item Now, they're sharing the same tmux session, and can co-edit their \texttt{helloworld.c} in
it.
\end{enumerate}
\subsubsection{Case 2}
\label{sec:org5b7463c}
If Alice and Bob use different username, for example, they both have accounts in \texttt{cs3}
server, and want to do co-working there, they can use a shared socket to achieve this.
\begin{enumerate}
\item Bob logins to \texttt{cs3}, and starts a tmux session with a shared socket.
\begin{verbatim}
ssh bob@cs3.swfu.edu.cn
tmux -S /tmp/bob new -s bob
chmod 777 /tmp/bob
\end{verbatim}
\item Alice ssh into \texttt{cs3}, and attach to Bob's tmux session
\begin{verbatim}
ssh alice@cs3.swfu.edu.cn
tmux -S /tmp/bob a -t bob
\end{verbatim}
\end{enumerate}

\subsubsection{More}
\label{sec:org1c72dfe}
\begin{itemize}
\item \texttt{man ssh}
\item \texttt{man tmux}
\item \href{http://www.zeespencer.com/building-a-remote-pairing-setup/}{Build a Command Line Remote Pairing Setup}
\item \href{http://blog.stevenhaddox.com/2012/04/11/remote-pairing-with-ssh-tmux-vim}{Remote Pairing With SSH, Tmux, and Vim}
\item \href{http://collectiveidea.com/blog/archives/2014/02/18/a-simple-pair-programming-setup-with-ssh-and-tmux/}{A Simple Pair Programming Setup with SSH and Tmux}
\item \href{http://evan.tiggerpalace.com/articles/2011/10/17/some-people-call-me-the-remote-pairing-guy-/}{Some people call me "the remote pairing guy"\ldots{}}
\item Googling \texttt{ssh tmux pair working}
\end{itemize}

Now, you are sitting in the lab. Please feel free to work together to get the following
tasks done.

\section{HTTP (15 pts)}
\label{sec:org7c2982f}
\subsection{Install Apache2}
\label{sec:org44ba9b6}
\begin{verbatim}
sudo aptitude install apache2
\end{verbatim}

\subsection{Play with it}
\label{sec:org680bb48}
\begin{description}
\item[{Your tasks}] Create your own website
\begin{itemize}
\item How do I know my web server is running? (\texttt{nmap}, \texttt{systemctl status apache2})
\item How to configure it? (\texttt{/usr/share/doc/apache2/}, \texttt{/etc/apache2/})
\item Is my apache2 working well? (\texttt{/var/log/apache2/})
\item Where is my homepage? (\texttt{/var/www/})
\item How to write a homepage? (\texttt{/var/www/index.html})
\item How to give every user a homepage? (\texttt{\textasciitilde{}/public\_html/index.html})
\end{itemize}
\end{description}

\section{Email (15 pts)}
\label{sec:org8db2ffd}
\subsection{SMTP (8 pts)}
\label{sec:org03e6550}
\subsubsection{Install Exim4}
\label{sec:org19b9fff}
\begin{verbatim}
sudo aptitude install exim4
\end{verbatim}

\subsubsection{Play with it}
\label{sec:orge8e72df}
\begin{description}
\item[{Your tasks}] \begin{itemize}
\item How do I know my SMTP server is running? (\texttt{nmap}, \texttt{systemctl status exim4})
\item How to configure it? (\texttt{/usr/share/doc/exim4/}, \texttt{/etc/exim4/},
\texttt{sudo dpkg-reconfigure exim4-config})
\item Is my exim4 working well? (\texttt{/var/log/exim4/})
\item How to send/receive emails? (\texttt{mail}, \texttt{mutt}, \texttt{nc server 25})
\end{itemize}
\end{description}

\subsection{POP3/IMAP4 (7 pts)}
\label{sec:org2ad3c4c}
\subsubsection{Install Dovecot roundcube}
\label{sec:org275513f}
\begin{verbatim}
sudo aptitude install dovecot-imapd dovecot-pop3d roundcube
\end{verbatim}

\subsubsection{Play with it}
\label{sec:org979f267}
\begin{description}
\item[{Your tasks}] \begin{itemize}
\item How do I know my POP3/IMAP4 server is running? (\texttt{nmap}, \texttt{systemctl status dovecot})
\item How to configure it? (\texttt{/usr/share/doc/dovecot*/}, \texttt{/etc/dovecot/},
\texttt{/usr/share/doc/roundcube-core}, \texttt{/etc/roundcube})
\item Is my dovecot working well? (\texttt{/var/log/mail.*/})
\item How to send/receive emails? (\texttt{/usr/share/doc/roundcube-core/})
\end{itemize}
\end{description}

\section{FTP (15 pts)}
\label{sec:orgc0c9c55}
\subsection{Install vsftpd lftp}
\label{sec:orgf3fea82}
\begin{verbatim}
sudo aptitude install vsftpd lftp
\end{verbatim}
\subsection{Play with it}
\label{sec:orgb26696f}
\begin{description}
\item[{Your tasks}] \begin{itemize}
\item How do I know my FTP server is running? (\texttt{nmap}, \texttt{systemctl status vsftpd})
\item How to configure it? (\texttt{/usr/share/doc/vsftpd/}, \texttt{/etc/vsftpd.conf})
\item Is my vsftpd working well? (\texttt{/var/log/vsftpd.log})
\item How to transfer files? (\texttt{lftp})
\end{itemize}
\end{description}

\section{IPTables (30 pts)}
\label{sec:org123474a}
\subsection{Writing a simple rule set}
\label{sec:orgc95cebd}
If you try the following commands:

\begin{verbatim}
$ sudo iptables -P INPUT ACCEPT
$ sudo iptables -F
$ sudo iptables -A INPUT -i lo -j ACCEPT
$ sudo iptables -A INPUT -m state --state ESTABLISHED,RELATED -j ACCEPT
$ sudo iptables -A INPUT -p tcp --dport 22 -j ACCEPT
$ sudo iptables -P INPUT DROP
$ sudo iptables -P FORWARD DROP
$ sudo iptables -P OUTPUT ACCEPT
$ sudo iptables -L -v
\end{verbatim}

You will get the following output:
\begin{verbatim}
Chain INPUT (policy DROP 0 packets, 0 bytes)
pkts bytes target   prot opt in   out  source     destination
 0     0   ACCEPT   all  --  lo   any  anywhere   anywhere
 0     0   ACCEPT   all  --  any  any  anywhere   anywhere   state RELATED,ESTABLISHED
 0     0   ACCEPT   tcp  --  any  any  anywhere   anywhere   tcp dpt:ssh
Chain FORWARD (policy DROP 0 packets, 0 bytes)
pkts bytes target     prot opt in     out     source   destination
Chain OUTPUT (policy ACCEPT 0 packets, 0 bytes)
pkts bytes target     prot opt in     out     source   destination
\end{verbatim}

Read the following short tutorial to know why:
\begin{itemize}
\item \href{http://wiki.centos.org/HowTos/Network/IPTables\#head-724ed81dbcd2b82b5fd3f648142796f3ce60c730}{Writing a simple rule set}
\end{itemize}

\subsection{Your tasks}
\label{sec:org89fab9e}
\begin{enumerate}
\item How to block all connections from your next desk?
\item How to block only SSH connections from your next desk?
\item How to block all other than SSH connections from your next desk?
\end{enumerate}

\subsection{References}
\label{sec:org7b937fa}
\begin{itemize}
\item \href{https://help.ubuntu.com/community/IptablesHowTo}{Iptables Howto}
\item \href{http://www.howtogeek.com/177621/the-beginners-guide-to-iptables-the-linux-firewall/}{The Beginner’s Guide to iptables, the Linux Firewall}
\item google \href{https://www.google.com/\#q\%3Diptables\%20tutorial\&oq\%3Diptables\%20\&aqs\%3Dchrome.2.69i57j0l5.9165j0j7\&sourceid\%3Dchrome\&es\_sm\%3D93\&ie\%3DUTF-8\&qscrl\%3D1}{\texttt{iptables tutorial}}
\end{itemize}
\end{document}